{"class_name": "Sequential", "sample_weight_mode": null, "loss": "mean_squared_error", "config": [{"class_name": "Dense", "config": {"b_regularizer": null, "batch_input_shape": [null, 24], "W_regularizer": null, "output_dim": 24, "W_constraint": null, "name": "dense_1", "input_dtype": "float32", "b_constraint": null, "bias": true, "activation": "linear", "trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "output_dim": 24, "W_constraint": null, "name": "dense_2", "b_constraint": null, "bias": true, "activation": "linear", "trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "output_dim": 5, "W_constraint": null, "name": "dense_3", "b_constraint": null, "bias": true, "activation": "linear", "trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_3"}}], "keras_version": "1.0.5", "optimizer": {"momentum": 0.8999999761581421, "lr": 0.10000000149011612, "decay": 9.999999974752427e-07, "name": "SGD", "nesterov": true}}