{"keras_version": "1.0.5", "optimizer": {"decay": 9.999999974752427e-07, "momentum": 0.8999999761581421, "nesterov": true, "name": "SGD", "lr": 0.10000000149011612}, "sample_weight_mode": null, "config": [{"config": {"W_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_1", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "batch_input_shape": [null, 24], "output_dim": 24}, "class_name": "Dense"}, {"config": {"activation": "tanh", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_2", "trainable": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 24}, "class_name": "Dense"}, {"config": {"activation": "tanh", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_3", "trainable": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 5}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "loss": "mean_squared_error", "class_name": "Sequential"}