{"keras_version": "1.0.5", "class_name": "Sequential", "loss": "mean_squared_error", "config": [{"config": {"trainable": true, "activity_regularizer": null, "input_dim": null, "name": "dense_1", "output_dim": 24, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 24], "b_regularizer": null, "input_dtype": "float32", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "input_dim": null, "name": "dense_2", "output_dim": 24, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "input_dim": null, "name": "dense_3", "output_dim": 5, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}], "sample_weight_mode": null, "optimizer": {"name": "SGD", "momentum": 0.8999999761581421, "lr": 0.10000000149011612, "decay": 9.999999974752427e-07, "nesterov": true}}